---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RampDoesntReachOffset
source: html/86ae6440-5226-bf7a-4ca2-100ef3e0d265.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RampDoesntReachOffset Property

The ramp is not long enough to reach the top constraint plus top offset. Change the slope or increase the length of the ramp.

## Syntax (C#)
```csharp
public static FailureDefinitionId RampDoesntReachOffset { get; }
```